Это вряд ли может быть проще. При использовании Camel с весны, вы можете держать на
используя фасоли весны по мере того как вы нормально, и верблюд будут использовать те фасоли плавно
без какой-либо конфигурации.

Во время компиляции нет прямых привязок,
и JVM не может связать вызывающего абонента с бобовым Верблюдом, должен решить это во время выполнения.

Сейчас, качество ВЭ в МЛ плохое и единственный источник того, какой ВЭ поедет на ТС  - ПЛ из УТП, поэтому и было принято решение менять ВЭ в МЛ СУТ на ВЭ из ПЛ УТП.
